#Создайте список [ 18, 14, 10, 6, 2 ] с помощью функции range() и выведите его на экран.

for i in range(18, 1, -4):
    print(i, end=' ')